Revit 2027 API
View.SetWorksetVisibility Method
 Sets visibility for a workset in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetWorksetVisibility(
	WorksetId worksetId,
	WorksetVisibility visible
)
Public Sub SetWorksetVisibility (
	worksetId As WorksetId,
	visible As WorksetVisibility
)
public:
void SetWorksetVisibility(
	WorksetId^ worksetId,
	WorksetVisibility visible
)
member SetWorksetVisibility :
        worksetId : WorksetId *
        visible : WorksetVisibility -> unit
Parameters
worksetId WorksetId
 Id of the workset.
visible WorksetVisibility
 The visibility of the workset.
Exceptions
Exception | Condition
ArgumentException |  There is no workset with this Id in the document associated with this view.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 It works even when the workset is closed. This settings overrules implicit visibility of the workset (for this particular view only).
See Also
Reference
View Class
Autodesk.Revit.DB Namespace